package gui.resources;

/**
 * Created by razor on 10.06.2017.
 */
public interface FinalTexts {
//    String aboutText = "Программное обеспечение\n"
//            + "для решения математических задач численными методами\n\"\n"
//            + "\b\t<b>Разработчики:</b>\n"
//            + "Чирва Я.А.\n"
//            + "Крамаренко В.И.\n"
//            + "Мартынцева А.В.\n"
//            + "Затчаева К.В.\n"
//            + "Макарычева Е.В.\n"
//            + "\b\tРуководители:\n" + "ас.каф.СУ Бабич И.И.\n"
//            + "к.т.н., проф. каф. АСУ Гужва В.А.\n\n"
//            + "\bХарьков 2011/2012\n";
//
//    String aboutLabel = "О программе";

    String aboutText = "\u041f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u043d\u043e\u0435 \u043e\u0431\u0435\u0441\u043f\u0435\u0447\u0435\u043d\u0438\u0435 \n"
        + "\u0434\u043b\u044f \u0440\u0435\u0448\u0435\u043d\u0438\u044f \u043c\u0430\u0442\u0435\u043c\u0430\u0442\u0438\u0447\u0435\u0441\u043a\u0438\u0445 \u0437\u0430\u0434\u0430\u0447 \u0447\u0438\u0441\u043b\u0435\u043d\u043d\u044b\u043c\u0438 \u043c\u0435\u0442\u043e\u0434\u0430\u043c\u0438 \n\n"
        + " \t \u0420\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u0447\u0438\u043a\u0438:\n"
        + "\u0427\u0438\u0440\u0432\u0430 \u042f.\u0410.\n"
        + "\u041a\u0440\u0430\u043c\u0430\u0440\u0435\u043d\u043a\u043e \u0412.\u0418.\n"
        + "\u041c\u0430\u0440\u0442\u044b\u043d\u0446\u0435\u0432\u0430 \u0410.\u0412.\n"
        + "\u0417\u0430\u0442\u0447\u0430\u0435\u0432\u0430 \u041a.\u0412.\n"
        + "\u041c\u0430\u043a\u0430\u0440\u044b\u0447\u0435\u0432\u0430 \u0415.\u0412.\n"
        + "\t \u0420\u0443\u043a\u043e\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u0438:\n" + "\u0430\u0441.\u043a\u0430\u0444.\u0421\u0423 \u0411\u0430\u0431\u0438\u0447 \u0418.\u0418.\n"
        + "\u043a.\u0442.\u043d., \u043f\u0440\u043e\u0444. \u043a\u0430\u0444. \u0410\u0421\u0423 \u0413\u0443\u0436\u0432\u0430 \u0412.\u0410.\n\n"
        + "\u0425\u0430\u0440\u044c\u043a\u043e\u0432 2011/2012\n";

    String aboutLabel = "\u041e \u043f\u0440\u043e\u0433\u0440\u0430\u043c\u043c\u0435";

}