package gui.resources;

/**
 * Created by razor on 10.06.2017.
 */
public interface MethodNames {
    String[] methodNames = new String[]{
            "",//0
            "Решение СЛАУ методом Гаусса",//1
            "Решение СЛАУ методом Якоби(простой итерации)",//2
            "Решение СЛАУ методом Гаусса-Зейделя",//3
            "Нахождение определителя матрицы методом Гаусса",//4
            "Нахождение обратной матрицы методом Гаусса",//5
            "",
            "Метод простой итерации(нелинейные уравнения)",//7
            "Метод Ньютона",//8
            "Метод Крылова",//9
            "Интерполяция Лагранжа",//10
            "Метод трапеций",//11
            "Формула Симпсона (Метод парабол)",//12
            "Метод прогонки"//13
    };
    String[] methodGroupsNames = new String[]{"\u041C\u0435\u0442\u043E\u0434\u044B \u043B\u0438\u043D\u0435\u0439\u043D\u043E\u0439 \u0430\u043B\u0433\u0435\u0431\u0440\u044B",//методы линейной алгебры
            "\u041C\u0435\u0442\u043E\u0434\u044B \u0440\u0435\u0448\u0435\u043D\u0438\u044F \u043D\u0435\u043B\u0438\u043D\u0435\u0439\u043D\u044B\u0445 \u0443\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u0439",//Методы решения нелинейных уравнений
            "\u041D\u0430\u0445\u043E\u0436\u0434\u0435\u043D\u0438\u0435 \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0445 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0438 \u0441\u043E\u0431\u0441\u0442\u0432\u0435\u043D\u043D\u044B\u0445 \u0432\u0435\u043A\u0442\u043E\u0440\u0430 \u043C\u0430\u0442\u0440\u0438\u0446\u044B",
            "\u0418\u043D\u0442\u0435\u0440\u043F\u043E\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0444\u0443\u043D\u043A\u0446\u0438\u0439",
            "\u0427\u0438\u0441\u043B\u0435\u043D\u043D\u043E\u0435 \u0438\u043D\u0442\u0435\u0433\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435",//Численное интегрирование
            "\u041A\u0440\u0430\u0435\u0432\u044B\u0435 \u0437\u0430\u0434\u0430\u0447\u0438 \u0434\u043B\u044F \u043E\u0431\u044B\u043A\u043D\u043E\u0432\u0435\u043D\u043D\u044B\u0445 \u0434\u0438\u0444\u0444\u0435\u0440\u0435\u043D\u0446\u0438\u0430\u043B\u044C\u043D\u044B\u0445 \u0443\u0440\u0430\u0432\u043D\u0435\u043D\u0438\u0439"//Краевые задачи для обыкновенных дифференциальных уравнений
    };
    int[][] methodsNumbers = new int[][]{
            {1, 2, 3, 4, 5},
            {7, 8},
            {9},
            {10},
            {11, 12},
            {13}
    };

    String[] buttonLabels = new String[]{
            "+", "-", "*", "/", "\u221A",
            "exp", "n!", "mod", "\u03C0", "x^y",
            "ln", "sin", "cos", "tg", ",",
            "log(x, y)", "sh", "ch", "th", "x",
            "lg", "arcsin", "arccos", "arctg", "(",
            "()", "arcsh", "arcch", "arcth", ")"
    };
    String[] buttonFuntions = new String[]{
            "+", "-", "*", "/", "sqrt()",
            "e", "fact()", "mod()", "Pi", "^",
            "ln()", "sin()", "cos()", "tan()", ".",
            "log(, )", "Sinh()", "cosh()", "Tanh()", "x",
            "lg()", "Asin()", "Acos()", "Atan()", "(",
            "()", "Asinh()", "arcch()", "arcth()", ")"};
}